// 선의의 순례 에고 기프트 등장 확률
const PILGRIMAGE_APPEAR_PROB = 0.1;
const PILGRIMAGE_HIDE_CLICK_COUNT = 5;

// 프리셋 이름 Placeholder 목록
const PRESET_PLACEHOLDER = [
    "이름",
    "박제가 되어버린 천재를 아시오?",
    "날개야 다시 돋아라.",
    "한번만 더 날아보자꾸나",
    "이상이 무엇이라 생각하시오.",
    "새장을 깨고, 자유롭게.",
    "이상이오.",
    "이상적이오.",
    "만곡된직선을직선으로질주하겠소",
    "영역전개:침잠쉐도",
    "이상으로 장례는 이상이오",
    "격정의 마음을 모방하겠소",
    "아홉째. 완료.",
    "위장에 묵직히 얹히는 총신을 느끼리라",
    "흉악한 총탄이 저들을 관통하리라...!",
    "그저 쏘아라, 계속 쏘아라!",
    "이 스며들 듯 하는 비에",
    "우산이 새지나 않나 모르겠소.",
    "지금을 쪼개어 일천",
    "편린들에 비추어진 미래를 쪼개어 다시 이천",
    "마침내 망그러진 과거는 깨어지겠소",
    "기어코 일순",
    "모든걸 그러모아... 삼천대천!"
];